---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.NonGenericAnnotationsOutsideLegend
source: html/bac2b14d-636f-48b9-99c3-d7275f414855.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.NonGenericAnnotationsOutsideLegend Property

Only Generic Annotations may be copied between Legends and other Views

## Syntax (C#)
```csharp
public static FailureDefinitionId NonGenericAnnotationsOutsideLegend { get; }
```